In [7]:
import pandas as pd
pd.read_csv('C:\\Users\\kundrasu\\Documents\\dat2.csv')

   ind       Num1  Num2
0    1      2.000    33
1    2     33.500    44
2    3     44.500    55
3    4    555.600    66
4    5   6666.700    77
5    6  88880.400   888
6    7   9999.333  9999

In [6]:
import pandas as pd

df = pd.read_excel (r'C:\Users\kundrasu\Documents\dat.xlsx')
print (df)

        1.00  2.33
0     22.000    33
1     33.500    44
2     44.500    55
3    555.600    66
4   6666.700    77
5  88880.400   888
6   9999.333  9999

In [10]:
import pandas as pd
pd.read_csv('C:\\Users\\kundrasu\\Documents\\vishal1.csv',index_col=["num2"],usecols=["num1","num2"],nrows=7)

      num1
num2
55      12
25      15
54      52
42      85
25      85
22      55
25      54

In [12]:
import pandas as pd
pd.read_csv('C:\\Users\\kundrasu\\Documents\\dat2.csv',index_col=["Num2"],usecols=["Num1","Num2"],nrows=7)

           Num1
Num2
33        2.000
44       33.500
55       44.500
66      555.600
77     6666.700
888   88880.400
9999   9999.333

In [15]:
temperature=[30,31,32,33,34,35,36,37,38,39,40,41]
months=["jan","feb","march","april","may","june","july","aug","sep","oct","nov","dec"]
s1=pd.Series(temperature,months)

In [17]:
s1

jan      30
feb      31
march    32
april    33
may      34
june     35
july     36
aug      37
sep      38
oct      39
nov      40
dec      41
dtype: int64

In [18]:
s1[5]

35

In [19]:
s1[2:9]

march    32
april    33
may      34
june     35
july     36
aug      37
sep      38
dtype: int64

In [20]:
mapob={30:300,31:310,32:40,34:100}
s1.map(mapob)

jan      300.0
feb      310.0
march     40.0
april      NaN
may      100.0
june       NaN
july       NaN
aug        NaN
sep        NaN
oct        NaN
nov        NaN
dec        NaN
dtype: float64